In [2]:
import pandas as pd
dictionary = {"name" :["Ahmet", "Mehmet", "Gökhan"],
             "age":[21, 24, 18],
             "note":[123,122,325]}
dataframe1 = pd.DataFrame(dictionary)
print(dataframe1)

     name  age  note
0   Ahmet   21   123
1  Mehmet   24   122
2  Gökhan   18   325

In [3]:
head = dataframe1.head()
print(head)

     name  age  note
0   Ahmet   21   123
1  Mehmet   24   122
2  Gökhan   18   325

In [4]:
print(dataframe1.columns)

Index(['name', 'age', 'note'], dtype='object')

In [5]:
print(dataframe1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   note    3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes
None

In [6]:
print(dataframe1.dtypes)

name    object
age      int64
note     int64
dtype: object

In [7]:
print(dataframe1.describe())

        age        note
count   3.0    3.000000
mean   21.0  190.000000
std     3.0  116.914499
min    18.0  122.000000
25%    19.5  122.500000
50%    21.0  123.000000
75%    22.5  224.000000
max    24.0  325.000000

In [8]:
print(dataframe1["name"])

0     Ahmet
1    Mehmet
2    Gökhan
Name: name, dtype: object

In [9]:
print(dataframe1.loc[:,"name"])

0     Ahmet
1    Mehmet
2    Gökhan
Name: name, dtype: object

In [10]:
print(dataframe1.loc[:3,"name"])

0     Ahmet
1    Mehmet
2    Gökhan
Name: name, dtype: object

In [11]:
print(dataframe1.loc[:3,"name":"note"])

     name  age  note
0   Ahmet   21   123
1  Mehmet   24   122
2  Gökhan   18   325

In [12]:
print(dataframe1.loc[::-1])

     name  age  note
2  Gökhan   18   325
1  Mehmet   24   122
0   Ahmet   21   123

In [14]:
filtre1 = dataframe1.age>10
dataframe1["bool"] = filtre1
print(dataframe1.loc[:,["age","bool"]])

   age  bool
0   21  True
1   24  True
2   18  True

In [16]:
filtre2 = dataframe1.note>100
filtrelenmis_data2 = dataframe1[filtre2&filtre1]
print(filtrelenmis_data2)

     name  age  note  bool
0   Ahmet   21   123  True
1  Mehmet   24   122  True
2  Gökhan   18   325  True

In [18]:
dataframe1.dropna(inplace=True)
dataframe1

     name  age  note  bool
0   Ahmet   21   123  True
1  Mehmet   24   122  True
2  Gökhan   18   325  True

In [19]:
dataframe1["situation"]=["below average" if dataframe1.note.mean()>each else "above average" for each in dataframe1.note]
dataframe1

     name  age  note  bool      situation
0   Ahmet   21   123  True  below average
1  Mehmet   24   122  True  below average
2  Gökhan   18   325  True  above average

In [22]:
dataframe1["yeni"] = [1,1,1]
dataframe1.columns = [each.split('_')[0]+" "+each.split('_')[1] if len(each.split('_'))>1 else each for each in dataframe1.columns]
dataframe1

     name  age  note  bool      situation  yeni
0   Ahmet   21   123  True  below average     1
1  Mehmet   24   122  True  below average     1
2  Gökhan   18   325  True  above average     1

In [23]:
dataframe1.columns = [each.upper() for each in dataframe1.columns]
dataframe1.columns

Index(['NAME', 'AGE', 'NOTE', 'BOOL', 'SITUATION', 'YENI'], dtype='object')

In [26]:
data1 = dataframe1.head()
data2 = dataframe1.tail()
data_concat = pd.concat([data1,data2],axis=1)
data_concat

,NAME,AGE,NOTE,BOOL,SITUATION,YENI,new_age,apply_metodu,NAME,AGE,NOTE,BOOL,SITUATION,YENI,new_age,apply_metodu
0,Ahmet,21,123,True,below average,1,42,42,Ahmet,21,123,True,below average,1,42,42
1,Mehmet,24,122,True,below average,1,48,48,Mehmet,24,122,True,below average,1,48,48
2,Gökhan,18,325,True,above average,1,36,36,Gökhan,18,325,True,above average,1,36,36

In [27]:
dataframe1["new_age"] = [each*2 for each in dataframe1.AGE]

def mlt(yas):
    return yas*2
dataframe1["apply_metodu"] = dataframe1.AGE.apply(mlt)
dataframe1

     NAME  AGE  NOTE  BOOL      SITUATION  YENI  new_age  apply_metodu
0   Ahmet   21   123  True  below average     1       42            42
1  Mehmet   24   122  True  below average     1       48            48
2  Gökhan   18   325  True  above average     1       36            36